apurv1012/stm32f407vgt6-arm-cortex-m4/Source/spi_cmd_handling.c
/*
 * spi_cmd_handling.c
 *
 *  Created on: Aug 16, 2021
 *      Author: ASUS
 */


#include<stdio.h>
#include<string.h>
#include "stm32f407xx.h"

extern void initialise_monitor_handles();

//command codes
#define COMMAND_LED_CTRL      		0x50
#define COMMAND_SENSOR_READ      	0x51
#define COMMAND_LED_READ      		0x52
#define COMMAND_PRINT      			0x53
#define COMMAND_ID_READ      		0x54

#define LED_ON     1
#define LED_OFF    0

//arduino analog pins
#define ANALOG_PIN0 	0
#define ANALOG_PIN1 	1
#define ANALOG_PIN2 	2
#define ANALOG_PIN3 	3
#define ANALOG_PIN4 	4

//arduino led

#define LED_PIN  9

void delay(void)
{
	for(uint32_t i = 0 ; i < 500000/2 ; i ++);
}

/*
 * PB14 --> SPI2_MISO
 * PB15 --> SPI2_MOSI
 * PB13 -> SPI2_SCLK
 * PB12 --> SPI2_NSS
 * ALT function mode : 5
 */

void SPI2_GPIOInits(void)
{
	GPIO_Handle_t SPIPins;

	SPIPins.pGPIOx = GPIOB;
	SPIPins.GPIO_PinConfig.GPIO_PinMode = GPIO_MODE_ALTFN;
	SPIPins.GPIO_PinConfig.GPIO_PinAltFunMode = 5;
	SPIPins.GPIO_PinConfig.GPIO_PinOPType = GPIO_OP_TYPE_PP;
	SPIPins.GPIO_PinConfig.GPIO_PinPuPdControl = GPIO_NO_PUPD;
	SPIPins.GPIO_PinConfig.GPIO_PinSpeed = GPIO_SPEED_FAST;

	//SCLK
	SPIPins.GPIO_PinConfig.GPIO_PinNumber = GPIO_PIN_NO_13;
	GPIO_Init(&SPIPins);

	//MOSI
	SPIPins.GPIO_PinConfig.GPIO_PinNumber = GPIO_PIN_NO_15;
	GPIO_Init(&SPIPins);

	//MISO
	SPIPins.GPIO_PinConfig.GPIO_PinNumber = GPIO_PIN_NO_14;
	GPIO_Init(&SPIPins);


	//NSS
	SPIPins.GPIO_PinConfig.GPIO_PinNumber = GPIO_PIN_NO_12;
	GPIO_Init(&SPIPins);


}

void SPI2_Inits(void)
{

	SPI_Handle_t SPI2handle;

	SPI2handle.pSPIx = SPI2;
	SPI2handle.SPIConfig.SPI_BusConfig = SPI_BUS_CONFIG_FD;
	SPI2handle.SPIConfig.SPI_DeviceMode = SPI_DEVICE_MODE_MASTER;
	SPI2handle.SPIConfig.SPI_SclkSpeed = SPI_SCLK_SPEED_DIV32;
	SPI2handle.SPIConfig.SPI_CPOL = SPI_CPOL_LOW;
	SPI2handle.SPIConfig.SPI_CPHA = SPI_CPHA_LOW;
	SPI2handle.SPIConfig.SPI_SSM = SPI_SSM_DI; //Hardware slave management enabled for NSS pin

	SPI_Init(&SPI2handle);
}

void GPIO_ButtonInit(void)
{
	GPIO_Handle_t GPIOBtn,GpioLed;

	//this is btn gpio configuration
	GPIOBtn.pGPIOx = GPIOA;
	GPIOBtn.GPIO_PinConfig.GPIO_PinNumber = GPIO_PIN_NO_0;
	GPIOBtn.GPIO_PinConfig.GPIO_PinMode = GPIO_MODE_IN;
	GPIOBtn.GPIO_PinConfig.GPIO_PinSpeed = GPIO_SPEED_FAST;
	GPIOBtn.GPIO_PinConfig.GPIO_PinPuPdControl = GPIO_NO_PUPD;

	GPIO_Init(&GPIOBtn);

	//this is led gpio configuration
	GpioLed.pGPIOx = GPIOD;
	GpioLed.GPIO_PinConfig.GPIO_PinNumber = GPIO_PIN_NO_12;
	GpioLed.GPIO_PinConfig.GPIO_PinMode = GPIO_MODE_OUT;
	GpioLed.GPIO_PinConfig.GPIO_PinSpeed = GPIO_SPEED_FAST;
	GpioLed.GPIO_PinConfig.GPIO_PinOPType = GPIO_OP_TYPE_OD;
	GpioLed.GPIO_PinConfig.GPIO_PinPuPdControl = GPIO_NO_PUPD;

	GPIO_PeriClockControl(GPIOD,ENABLE);

	GPIO_Init(&GpioLed);

}


uint8_t SPI_VerifyResponse(uint8_t ackbyte)
{

	if(ackbyte == (uint8_t)0xF5)
	{
		//ack
		return 1;
	}

	return 0;
}

int main(void)
{
	uint8_t dummy_write = 0xff;
	uint8_t dummy_read;

	initialise_monitor_handles();
	printf("Application is running\n");

	GPIO_ButtonInit();

	//this function is used to initialize the GPIO pins to behave as SPI2 pins
	SPI2_GPIOInits();

	//This function is used to initialize the SPI2 peripheral parameters
	SPI2_Inits();

	printf("SPI Init. done\n");

	/*
	* making SSOE 1 does NSS output enable.
	* The NSS pin is automatically managed by the hardware.
	* i.e when SPE=1 , NSS will be pulled to low
	* and NSS pin will be high when SPE=0
	*/
	SPI_SSOEConfig(SPI2,ENABLE);

	while(1)
	{
		//wait till button is pressed
		while( ! GPIO_ReadFromInputPin(GPIOA,GPIO_PIN_NO_0) );

		//to avoid button de-bouncing related issues 200ms of delay
		delay();

		//enable the SPI2 peripheral
		SPI_PeripheralControl(SPI2,ENABLE);

	    //1. CMD_LED_CTRL  	<pin no(1)>     <value(1)>

		uint8_t commandcode = COMMAND_LED_CTRL;
		uint8_t ackbyte;
		uint8_t args[2];

		//send command
		SPI_SendData(SPI2,&commandcode,1);

		//do dummy read to clear off the RXNE
		SPI_ReceiveData(SPI2,&dummy_read,1);


		//Send some dummy bits (1 byte) fetch the response from the slave
		SPI_SendData(SPI2,&dummy_write,1);

		//read the ack byte received
		SPI_ReceiveData(SPI2,&ackbyte,1);

		if( SPI_VerifyResponse(ackbyte))
		{
			args[0] = LED_PIN;
			args[1] = LED_ON;

			//send arguments
			SPI_SendData(SPI2,args,2);
			// dummy read
			SPI_ReceiveData(SPI2,args,2);
			printf("COMMAND_LED_CTRL Executed\n");
		}
		//end of COMMAND_LED_CTRL




		//2. CMD_SENOSR_READ   <analog pin number(1) >

		//wait till button is pressed
		while( ! GPIO_ReadFromInputPin(GPIOA,GPIO_PIN_NO_0) );

		//to avoid button de-bouncing related issues 200ms of delay
		delay();

		commandcode = COMMAND_SENSOR_READ;

		//send command
		SPI_SendData(SPI2,&commandcode,1);

		//do dummy read to clear off the RXNE
		SPI_ReceiveData(SPI2,&dummy_read,1);


		//Send some dummy byte to fetch the response from the slave
		SPI_SendData(SPI2,&dummy_write,1);

		//read the ack byte received
		SPI_ReceiveData(SPI2,&ackbyte,1);

		if( SPI_VerifyResponse(ackbyte))
		{
			args[0] = ANALOG_PIN0;

			//send arguments
			SPI_SendData(SPI2,args,1); //sending one byte of

			//do dummy read to clear off the RXNE
			SPI_ReceiveData(SPI2,&dummy_read,1);

			//insert some delay so that slave can ready with the data
			delay();

			//Send some dummy bits (1 byte) fetch the response from the slave
			SPI_SendData(SPI2,&dummy_write,1);

			uint8_t analog_read;
			SPI_ReceiveData(SPI2,&analog_read,1);
			printf("COMMAND_SENSOR_READ %d\n",analog_read);
		}


		//3.  CMD_LED_READ 	 <pin no(1) >



		while( ! GPIO_ReadFromInputPin(GPIOA,GPIO_PIN_NO_0))
		{

		}

				//to avoid button de-bouncing related issues 200ms of delay
				delay();

				commandcode = COMMAND_LED_READ;
				//send command code to get ack from slave
				SPI_SendData(SPI2, &commandcode, 1);

				//receive dummy byte to clear RXNE
				SPI_ReceiveData(SPI2, &dummy_read, 1);

				////send dummy byte to provide clock for ack byte from slave
				SPI_SendData(SPI2, &dummy_write, 1);

				//Receive ack byte
				SPI_ReceiveData(SPI2, &ackbyte, 1);

				//check weather recieved byte is is ack or not
				if(SPI_VerifyResponse(ackbyte))
				{
					args[0] = LED_PIN;
					//send pin no arduino led which master is reading
					SPI_SendData(SPI2, args, 1);

					//receive dummy byte to clear RXNE
					SPI_ReceiveData(SPI2, &dummy_read, 1);

					//insert some delay so that slave can ready with the data
					delay();

					uint8_t LED_STATUS;
					//send dummy byte to retrive LED status
					SPI_SendData(SPI2, &dummy_write, 1);

					//receive LED status
					SPI_ReceiveData(SPI2,&LED_STATUS, 1);
					printf("Command Read Led is %d\n",LED_STATUS);

				}


				//4. CMD_PRINT 		<len(2)>  <message(len) >
				while( ! GPIO_ReadFromInputPin(GPIOA,GPIO_PIN_NO_0))
					{

					}

					//to avoid button de-bouncing related issues 200ms of delay
						delay();

						commandcode = COMMAND_PRINT;
						//send command code to get ack from slave
						SPI_SendData(SPI2, &commandcode, 1);

						//receive dummy byte to clear RXNE
						SPI_ReceiveData(SPI2, &dummy_read, 1);

						//send dummy byte to provide clock for ack byte from slave
						SPI_SendData(SPI2, &dummy_write, 1);

						//Receive ack byte
						SPI_ReceiveData(SPI2, &ackbyte, 1);

						uint8_t message[] = "Hello ! How are you ??";
						//check weather recieved byte is is ack or not
						if(SPI_VerifyResponse(ackbyte))
							{
								args[0]=strlen((char*)message);

								//send arguments
								SPI_SendData(SPI2, args, 1);

								//receive dummy byte to clear RXNE
								SPI_ReceiveData(SPI2, &dummy_read, 1);

								//send message
								for(int i=0; i<args[0]; i++ )
								{

									//send arguments
									SPI_SendData(SPI2,&message[i], 1);

									//receive dummy byte to clear RXNE
									SPI_ReceiveData(SPI2, &dummy_read, 1);


								}


								printf("Command Print  Executed\n");

								}


						//5. CMD_ID_READ
						while( ! GPIO_ReadFromInputPin(GPIOA,GPIO_PIN_NO_0))
								{

								}
							//to avoid button de-bouncing related issues 200ms of delay
								delay();

							commandcode = COMMAND_ID_READ;
							//send command code to get ack from slave
							SPI_SendData(SPI2, &commandcode, 1);

							//receive dummy byte to clear RXNE
							SPI_ReceiveData(SPI2, &dummy_read, 1);

							//send dummy byte to provide clock for ack byte from slave
							SPI_SendData(SPI2, &dummy_write, 1);

							//Receive ack byte
							SPI_ReceiveData(SPI2, &ackbyte, 1);

							uint8_t id[11];
							uint32_t i=0;
							//check weather recieved byte is is ack or not
							if(SPI_VerifyResponse(ackbyte))
							{
									for(i=0; i<11; i++)
									{

										//send dummy byte to read id
										SPI_SendData(SPI2, &dummy_write, 1);

										//receive id from slave
										SPI_ReceiveData(SPI2, &id[i], 1);


									}

									id[10] = '\0';

									printf("COMMAND_ID : %s \n",id);
							}



		//lets confirm SPI is not busy
				while( SPI_GetFlagStatus(SPI2,SPI_BUSY_FLAG) );

				//Disable the SPI2 peripheral
				SPI_PeripheralControl(SPI2,DISABLE);

				printf("SPI Communication Closed\n");
		}

			return 0;

}
